In [1]:
!pip install psycopg2
import pandas
import configparser
import psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
config = configparser.ConfigParser ()
config.read ('config.ini')

['config.ini']

In [3]:
host = config['myaws']['host']
database = config['myaws']['database']
user = config['myaws']['user']
pwd = config['myaws']['pwd']

In [4]:
conn = psycopg2.connect(host = host,
                       user = user,
                       password = pwd,
                       dbname = database
                       )

In [5]:
cur = conn.cursor()

# Question 1

In [6]:
sql_statement = '''
            select * from student_gp18_1
                '''

In [7]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

,email,name,major
0,lucasg@dukes.jmu.edu ...,George Lucas ...,IA
1,rogerss@dukes.jmu.edu ...,Steve Rogers ...,IA
2,rossb@dukes.jmu.edu ...,Bob Ross ...,IA
3,halsta@dukes.jmu.edu ...,Alexa Halstead ...,IA
4,leewaj@dukes.jmu.edu ...,Jacob Leeway ...,IA
5,legit_email ...,bobby_hill ...,IA
6,demo_email ...,hank_hill ...,IA
7,demo_2email ...,dale_gribble ...,BasketWeaving
8,some_email ...,john_redcorn ...,BasketWeaving
9,jonesk@dukes.jmu.edu ...,Kent Jones ...,IA
10,jonesb@dukes.jmu.edu ...,Bob Jones ...,IA

# Question 2

In [8]:
sql_statement = '''
            select cname, count(semail)
            from enrolllist_gp18_1
            group by cname
            order by count(semail) desc
            limit 1
                '''

In [9]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

                                               cname  count
0  IA150                                         ...      3

# Question 3

In [10]:
sql_statement = '''
            select
            teacher_gp18_1.name as tname,
            course_gp18_1.name as cname
            from teacher_gp18_1
            inner join course_gp18_1
            on teacher_gp18_1.email = course_gp18_1.temail
                '''

In [11]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

,tname,cname
0,Noel Hendrickson ...,IA300 ...
1,Bob Kolvoord ...,IA150 ...
2,David McGraw ...,IA250 ...
3,Kathleen Moore ...,IA350 ...
4,Herald Golf ...,IA450 ...
5,Ricky Bobby ...,IA460 ...
6,Rob Kang ...,IA240 ...
7,Rob Kang ...,IA400 ...

# Question 4

In [12]:
sql_statement = '''
            select
            teacher_gp18_1.name as tname,
            count(course_gp18_1.name) as course_name
            from teacher_gp18_1
            inner join course_gp18_1
            on teacher_gp18_1.email = course_gp18_1.temail
            group by teacher_gp18_1.name
            order by count(course_gp18_1) desc
            limit 1
                '''

In [13]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

                                               tname  course_name
0  Rob Kang                                      ...            2

# Question 5

In [14]:
sql_insert_statement= '''
                    insert into teacher_gp18_1 (email,name,office)
                    values ('{}','{}','{}')
                        '''.format('new_email1','new_name1','new_office1')
print(sql_insert_statement)

                    insert into teacher_gp18_1 (email,name,office)
                    values ('new_email1','new_name1','new_office1')

In [16]:
#cur.execute(sql_insert_statement)

In [17]:
conn.commit()

In [18]:
df = pandas.read_sql_query('''select * from teacher_gp18_1''', conn)
df[:]

,email,name,office
0,hendrixn@dukes.jmu.edu ...,Noel Hendrickson ...,ISAT317 ...
1,kolvoora@dukes.jmu.edu ...,Bob Kolvoord ...,ISAT370 ...
2,mcgrawdk@dukes.jmu.edu ...,David McGraw ...,ISAT352 ...
3,moore8ka@dukes.jmu.edu ...,Kathleen Moore ...,ISAT116 ...
4,hearldg@dukes.jmu.edu ...,Herald Golf ...,ISAT405 ...
5,straightg@dukes.jmu.edu ...,George Straight ...,ISAT450 ...
6,bobbyr@dukes.jmu.edu ...,Ricky Bobby ...,ISAT356 ...
7,kangr@dukes.jmu.edu ...,Rob Kang ...,ISAT347 ...
8,new_email1 ...,new_name1 ...,new_office1 ...

# Question 6

In [19]:
sql_insert_statement= '''
                        update course_gp18_1
                        set temail = 'new_email1'
                        where temail = 'hearldg@dukes.jmu.edu'
                        '''
print(sql_insert_statement)

                        update course_gp18_1
                        set temail = 'new_email1'
                        where temail = 'hearldg@dukes.jmu.edu'

In [20]:
sql_insert_statement2= '''
                        delete from teacher_gp18_1
                        where email = 'hearldg@dukes.jmu.edu'
                        '''
print(sql_insert_statement2)

                        delete from teacher_gp18_1
                        where email = 'hearldg@dukes.jmu.edu'

In [21]:
cur.execute(sql_insert_statement)
conn.commit()

In [22]:
cur.execute(sql_insert_statement2)
conn.commit()

In [23]:
df = pandas.read_sql_query('''select * from course_gp18_1''', conn)
df[:]

,name,room,temail
0,IA300 ...,ISAT120 ...,hendrixn@dukes.jmu.edu ...
1,IA150 ...,ISAT121 ...,kolvoora@dukes.jmu.edu ...
2,IA250 ...,ISAT304 ...,mcgrawdk@dukes.jmu.edu ...
3,IA350 ...,ISAT205 ...,moore8ka@dukes.jmu.edu ...
4,IA460 ...,ISAT430 ...,bobbyr@dukes.jmu.edu ...
5,IA240 ...,ISAT310 ...,kangr@dukes.jmu.edu ...
6,IA400 ...,ISAT 123 ...,kangr@dukes.jmu.edu ...
7,IA450 ...,ISAT340 ...,new_email1 ...

In [24]:
df = pandas.read_sql_query('''select * from teacher_gp18_1''', conn)
df[:]

,email,name,office
0,hendrixn@dukes.jmu.edu ...,Noel Hendrickson ...,ISAT317 ...
1,kolvoora@dukes.jmu.edu ...,Bob Kolvoord ...,ISAT370 ...
2,mcgrawdk@dukes.jmu.edu ...,David McGraw ...,ISAT352 ...
3,moore8ka@dukes.jmu.edu ...,Kathleen Moore ...,ISAT116 ...
4,straightg@dukes.jmu.edu ...,George Straight ...,ISAT450 ...
5,bobbyr@dukes.jmu.edu ...,Ricky Bobby ...,ISAT356 ...
6,kangr@dukes.jmu.edu ...,Rob Kang ...,ISAT347 ...
7,new_email1 ...,new_name1 ...,new_office1 ...

In [26]:
cur.close()
conn.close()